doublebooking141/handy_keyboard/03.firmware/04.integratedAPP/sdkconfig.defaults
# Rust always uses custom partitions
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ESP32-P4 specific
CONFIG_IDF_TARGET="esp32p4"

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Log output
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Enable I2C
CONFIG_I2C_ENABLE_DEBUG_LOG=n

# ESP-IDF Component settings
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
